Revit 2027 API
Document.GetElement(String) Method
 Gets the Element referenced by a unique id string.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Element GetElement(
	string uniqueId
)
Public Function GetElement (
	uniqueId As String
) As Element
public:
Element^ GetElement(
	String^ uniqueId
)
member GetElement :
        uniqueId : string -> Element
Parameters
uniqueId String
 The element unique id, whose referenced Element will be retrieved from the model.
UniqueId
Return Value
Element
 The element referenced by the input argument.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
null will be returned if the input id string doesn't reference to a valid Element.
See Also
Reference
Document Class
GetElement Overload
Autodesk.Revit.DB Namespace